tap 'homebrew/cask-versions'

brew 'bash'
brew 'bash-completion'
brew 'git'
brew 'htop'

brew 'postgresql@9.6', restart_service: true
brew 'redis@3.2', restart_service: :changed
brew 'yarn'
brew 'heroku'
brew 'heroku/brew/heroku'
brew 'direnv'
brew 'diff-so-fancy'
brew 'github/gh/gh'

tap 'tomanthony/brews'
brew 'tomanthony/brews/itermocil'

# asdf dependencies
brew 'asdf'
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'unzip'
brew 'curl'
brew 'gpg'
brew 'wxmac' # observer or debugger

cask 'boostnote'
cask 'clockify'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'rescuetime'
cask 'sequel-pro'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'xmind'
cask 'firefox'
cask 'psequel'
cask 'authy'
cask 'adobe-acrobat-reader'

brew 'mas'

mas 'Keynote', id: 409183694
mas 'Trello', id: 1278508951
mas 'Wunderlist', id: 410628904
mas 'Clocker', id: 1056643111
mas 'XCode', id: 497799835

brew 'graphviz'
